
## Plan Result




<pre><code>Plan: 13 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-PASS-V15
  * azurerm_key_vault_secret.POSTGRES-USER-V15
  * azurerm_key_vault_secret.POSTGRES_DATABASE-V15
  * azurerm_key_vault_secret.POSTGRES_HOST-V15
  * azurerm_key_vault_secret.POSTGRES_PORT-V15
  * module.bar-database-v15.azurerm_postgresql_flexible_server.pgsql_server
  * module.bar-database-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.bar-database-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.bar-database-v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.bar-database-v15.azurerm_postgresql_flexible_server_database.pg_databases[&#34;bar&#34;]
  * module.bar-database-v15.azurerm_resource_group.rg[0]
  * module.bar-database-v15.null_resource.set-user-permissions-additionaldbs[&#34;bar&#34;]
  * module.bar-database-v15.random_password.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bar-aat-rg/providers/Microsoft.KeyVault/vaults/bar-aat"
      + name                    = "api-POSTGRES-PASS-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bar-aat-rg/providers/Microsoft.KeyVault/vaults/bar-aat"
      + name                    = "api-POSTGRES-USER-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bar-aat-rg/providers/Microsoft.KeyVault/vaults/bar-aat"
      + name                    = "api-POSTGRES-DATABASE-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bar-aat-rg/providers/Microsoft.KeyVault/vaults/bar-aat"
      + name                    = "api-POSTGRES-HOST-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bar-aat-rg/providers/Microsoft.KeyVault/vaults/bar-aat"
      + name                    = "api-POSTGRES-PORT-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.bar-database-v15.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "bar"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "bar-api-postgres-db-v15-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "bar-api-postgres-db-v15-data-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "fees-and-payments"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/bar-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "staging"
          + "managedBy"           = "Fees/Pay"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.bar-database-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "bar-api-postgres-db-v15-data-aat"
      + server_name         = "bar-api-postgres-db-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.bar-database-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "bar-api-postgres-db-v15-data-aat"
      + server_name         = "bar-api-postgres-db-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.bar-database-v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "plpgsql,pg_stat_statements,pg_buffercache"
    }

  # module.bar-database-v15.azurerm_postgresql_flexible_server_database.pg_databases["bar"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "bar"
      + server_id = (known after apply)
    }

  # module.bar-database-v15.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "bar-api-postgres-db-v15-data-aat"
      + tags     = {
          + "application"         = "fees-and-payments"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/bar-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "staging"
          + "managedBy"           = "Fees/Pay"
        }
    }

  # module.bar-database-v15.null_resource.set-user-permissions-additionaldbs["bar"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "name"           = "bar-api-postgres-db-v15"
          + "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93"
        }
    }

  # module.bar-database-v15.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":622,"Program":"tfcmt","SHA1":"","Vars":{}} -->